/*
题目：打印出杨辉三角形（要求打印出10行）。
程序分析：
结构如下所示：
1
1    1
1    2    1
1    3    3    1
1    4    6    4    1
*/

#include <stdio.h>

int main(void)
{
    int a[10][10];
    int i, j;
    for (i = 0; i < 10; i++) // 关注杨辉三角中的所以1值
    {
        a[i][0] = 1;
        a[i][i] = 1;
    }

    for (i = 2; i < 10; i++)
        for (j = 1; j < i; j++) // j<i; j取不到i【因为这里只关注杨辉三角中的非1值】
            a[i][j] = a[i - 1][j - 1] + a[i - 1][j];

    for (i = 0; i < 10; i++) // 打印二维数组中的每个元素
    {
        for (j = 0; j <= i; j++) // j<=i; 【因为a[i][j] i==j的二维数组元素要打印出来】
            printf("%5d", a[i][j]);
        printf("\n");
    }

    return 0;
}