/*
题目：求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。例如2+22+222+2222+22222(此时共有5个数相加)，几个数相加有键盘控制。

程序分析：关键是计算出每一项的值。
*/

#include <stdio.h>

int main(void)
{
  int a, n;
  int t, sum = 0;

  printf("input a and n:");
  scanf("%d %d", &a, &n);

  t = a;
  while (n > 0)
  {
    sum += t;         //2(1)      2+22(2)       2+22+222(3)     2+22+222+2222(4)    2+22+222+2222+22222(5) 
    a = a * 10;       
    t = t + a;        //2+20(1)   22+200(2)     222+2000(3)     2222+20000(4)       22222+200000(5)
    n--; 
  }

  printf("%d", sum);
  return 0;
}