/*
题目：打印出如下图案（菱形）。
程序分析：先把图形分成两部分来看待，前四行一个规律，后三行一个规律，利用双重for循环，第一层控制行，第二层控制列。
*/

#include <stdio.h>

int main(void)
{
  int i, j, k;
  //主要就是输出*，不是输出空格
  //对于每一行，只需要考虑*前面空格的个数规律，以及*的个数规律就行。
  for (i = 0; i <= 3; i++)
  {
    for (j = 0; j <= 2-i; j++)
      printf(" ");
    for (k = 0; k <= 2*i; k++)
      printf("*");
    printf("\n"); //输出完一行后换行
  }
  for(i = 0; i <= 2; i++)
  {
    for (j = 0; j <= i; j++)
      printf(" ");
    for (k = 0; k <= 4-2*i; k++)
      printf("*");
    if (i <= 1)     //去掉最后一行空行
      printf("\n"); //输出完一行后换行
  }

  return 0;
}